<h1>
   <font color = "grey">Fundamentos da linguagem Python</font>
</h1>

# MÓDULO 1

## 1.1. Operadores matemáticos

In [39]:
# adição 

5 + 7

12

In [40]:
# subtração 

21 - 9

12

In [41]:
# multiplicação 

3 * 9

27

In [42]:
# divisão

59 / 3

19.666666666666668

### 1.1.1. Operação com variáveis

In [43]:
a = 39

In [44]:
b = a + 1

In [45]:
b

40

In [46]:
b * 2

80

**Aquecimento operadores matemáticos**

In [47]:
# compras 


arroz = 10
leite = 11.50
carne = 30.80
sabonete = 9.56
alvejante = 19.58

In [48]:
resultado = arroz + leite + carne + sabonete + alvejante

In [49]:
resultado

81.44

In [50]:
print('O valor total das compras é: R$', resultado)

O valor total das compras é: R$ 81.44

In [51]:
# potenciação 

2 ** 2

4

In [52]:
# módulo ou resto da divisão 

10 % 7

3

## 1.2. Operadores relacionais

In [53]:
# igualdade

700 == 90

False

In [54]:
100 == 100

True

In [55]:
80.0 == 80

True

In [56]:
# desigualdade 

3 != 7

True

In [57]:
3 != 3

False

In [58]:
# maior que 

500 > 90

True

In [59]:
90 > 500

False

In [60]:
# menor que 

500 < 90

False

In [61]:
90 < 500

True

In [62]:
# maior ou igual 

8 >= 8

True

In [63]:
5 >= 10

False

## 1.3. Operadores lógicos

**and** = e

**or** = ou 

**not** = não

**and** = se todas as alternativas forem verdadeiras

**or** = se pelo menos uma das alternativas forem verdadeiras

**not** = se for verdadeira será falso

**1.Para estudar em uma universidade, o aluno deve:**


Ter passado no vestibular

e

Estar com toda documentação necessária

e 

Estar matriculado

In [64]:
50 > 40 and 50 > 49

True

**2. Para obter flexibilidade no período de provas, o aluno deve:**

Ser militar e estar de serviço

ou 

Estar de licença maternidade

ou 

Estar de atestado médico

In [65]:
80 > 3 or 15 > 20

True

## 1.4. Laços de repetiçoes for

In [66]:
for i in range (0, 20, 3):
    print(i)

0
3
6
9
12
15
18

Essa função cria um loop de um range(sequencia numerica) 

for é função (i) é a variável in conecta ao range ( inicio da sequncia, fim da sequencia, intervalos)

In [67]:
lista = [3, 8, 44, 100]

In [68]:
for x in lista:
    print(x)

3
8
44
100

In [69]:
lista2 = [3, 8, 44, 100]

In [70]:
for i in lista2:
    
    if i % 2 == 0:
     print(i)

8
44
100

In [71]:
lista3 = [ [1,2,3], [2,3,5], [7,8,5,4,3,2] ]

In [72]:
for ii in lista3:
    print(ii)

[1, 2, 3]
[2, 3, 5]
[7, 8, 5, 4, 3, 2]

In [73]:
di = {'d1': 10,'d2': 20,'d3': 30,'d4': 40,'d5': 50, };

d2 = {'d2': 10,'d2': 20,'d2': 30,'d2': 40,'d2': 50};

In [74]:
di

{'d1': 10, 'd2': 20, 'd3': 30, 'd4': 40, 'd5': 50}

In [75]:
for i in di:
    print(i)

d1
d2
d3
d4
d5

In [76]:
di.items()

dict_items([('d1', 10), ('d2', 20), ('d3', 30), ('d4', 40), ('d5', 50)])

In [77]:
for c, v, in di.items():
    print( c, v)

d1 10
d2 20
d3 30
d4 40
d5 50

## 1.5. Laços de repetiçoes whille(enquanto)

In [78]:
k = 8

while k <= 10:
    print(k)
    
    k += 1

8
9
10

**pass, break e continue**

In [79]:
for letra in 'programador':
    if letra == 'a':
        pass
    print(letra)

p
r
o
g
r
a
m
a
d
o
r

In [80]:
for letra in 'programador':
    if letra == 'a':
        continue
    print(letra)

p
r
o
g
r
m
d
o
r

In [81]:
for letra in 'programador':
    if letra == 'a':
        break
    print(letra)

p
r
o
g
r

## 1.6. Funções

In [82]:
 def print_text():
    print('Aqui é um texto qaulquer')

In [83]:
print_text()

Aqui é um texto qaulquer

In [84]:
def print_isto(x):
    print(x)

In [85]:
print_isto(7958)

7958

In [86]:
def potencia(x):
    p = x ** 2
    return p

In [87]:
potencia(4)

16

In [88]:
def sub(x):
    r = x + 4
    return r

In [89]:
sub (1000)

1004

In [90]:
def potencia_n(x, n = 2 ):
    p = x ** n
    return p

In [91]:
potencia_n(5)

25

In [92]:
potencia_n(5, 3)

125

# MÓDULO 2

## 2.1. Dataframes

In [93]:
import pandas as pd
import numpy as np

In [94]:
series = pd.Series([7, 4, 2, np.nan, 6, 9 ])

In [95]:
series

0    7.0
1    4.0
2    2.0
3    NaN
4    6.0
5    9.0
dtype: float64

In [96]:
type(series)

pandas.core.series.Series

In [97]:
datas = pd.date_range('20220101', periods = 6 )

In [98]:
datas

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [99]:
type(datas)

pandas.core.indexes.datetimes.DatetimeIndex

In [100]:
df = pd.DataFrame(np.random.randn(6,4), index= datas, columns = list('ABCD'))

In [101]:
df

                   A         B         C         D
2022-01-01 -0.370136 -1.215329  0.379889  1.431185
2022-01-02  0.099705  1.705543  1.146245  1.403920
2022-01-03  0.897916  0.342919 -0.669462  0.828891
2022-01-04 -0.442001 -0.668094  1.165814  0.062994
2022-01-05 -0.037098  0.484880  0.020509 -0.189240
2022-01-06 -0.454273 -0.124775 -0.731120 -0.775052

In [102]:
df2 = pd.DataFrame({'A': 7,
                    'B': pd.Timestamp('20220101'),
                    'C': pd.Series(1, index=list(range(4)), dtype = 'float32'),
                    'D': np.array([3] * 4, dtype = 'int32'), 
                    'E': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'Python'})

In [103]:
df2

   A          B    C  D      E       F
0  7 2022-01-01  1.0  3   test  Python
1  7 2022-01-01  1.0  3  train  Python
2  7 2022-01-01  1.0  3   test  Python
3  7 2022-01-01  1.0  3  train  Python

In [104]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## 2.2. Merge

In [105]:
# Cadastro da loja a
cadastro_a = {'Id': ['AA2930','BB4563','CC2139','DE2521','GT3462','HH1158'],
            'Nome':  ['Victor', 'Amanda', 'Bruna', 'Carlos', 'Ricardo', 'Maria'],
            'Idade': [20,35,40,54,30,27],
            'CEP': ['00092-029','11111-111','22222-888','00000-999','88888-111','77777-666']
           }

cadastro_a = pd.DataFrame(cadastro_a, columns = ['Id','Nome','Idade','CEP'])
cadastro_a

       Id     Nome  Idade        CEP
0  AA2930   Victor     20  00092-029
1  BB4563   Amanda     35  11111-111
2  CC2139    Bruna     40  22222-888
3  DE2521   Carlos     54  00000-999
4  GT3462  Ricardo     30  88888-111
5  HH1158    Maria     27  77777-666

In [106]:
# Cadastro da loja b
cadastro_b = {'Id': ['CC9999','EF4488','DD9999','GT3462','HH1158'],
            'Nome':  ['Marcos', 'Patricia', 'Ericka', 'Ricardo', 'Maria'],
            'Idade': [19,30,22,30,27],
            'CEP': ['00092-029','11111-111','11111-888','88888-111','77777-666']
           }
 
cadastro_b = pd.DataFrame(cadastro_b, columns = ['Id','Nome','Idade','CEP'])
cadastro_b

       Id      Nome  Idade        CEP
0  CC9999    Marcos     19  00092-029
1  EF4488  Patricia     30  11111-111
2  DD9999    Ericka     22  11111-888
3  GT3462   Ricardo     30  88888-111
4  HH1158     Maria     27  77777-666

In [107]:
# Registro de compras de todas unidades
compras = {'Id': ['AA2930','EF4488','CC2139','EF4488','CC9999','AA2930','HH1158','HH1158'],
            'Data':  ['2019-01-01','2019-01-30','2019-01-30','2019-02-01','2019-02-20','2019-03-15','2019-04-01','2019-04-10'],
            'Valor': [200,100,40,150,300,25,50,500]
           }
 
compras = pd.DataFrame(compras, columns = ['Id','Data','Valor'])

compras

       Id        Data  Valor
0  AA2930  2019-01-01    200
1  EF4488  2019-01-30    100
2  CC2139  2019-01-30     40
3  EF4488  2019-02-01    150
4  CC9999  2019-02-20    300
5  AA2930  2019-03-15     25
6  HH1158  2019-04-01     50
7  HH1158  2019-04-10    500

* Merge **inner join** junta a interceção entre as tabelas

In [108]:
pd.merge(cadastro_a, cadastro_b[['Id', 'Idade', 'CEP']], on= ['Id'], how='inner', suffixes= ('_A', '_B'))

       Id     Nome  Idade_A      CEP_A  Idade_B      CEP_B
0  GT3462  Ricardo       30  88888-111       30  88888-111
1  HH1158    Maria       27  77777-666       27  77777-666

* Merge **full join** junta a todas as informações das tabelas

In [109]:
lojas = pd.concat([cadastro_a, cadastro_b], ignore_index= True)

In [110]:
clientes_unicos = lojas.drop_duplicates(subset=['Id'])

In [111]:
clientes_unicos

       Id      Nome  Idade        CEP
0  AA2930    Victor     20  00092-029
1  BB4563    Amanda     35  11111-111
2  CC2139     Bruna     40  22222-888
3  DE2521    Carlos     54  00000-999
4  GT3462   Ricardo     30  88888-111
5  HH1158     Maria     27  77777-666
6  CC9999    Marcos     19  00092-029
7  EF4488  Patricia     30  11111-111
8  DD9999    Ericka     22  11111-888

* Merge **left join** junta informações do lado esquerdo da tabela

In [112]:
esquerda = pd.merge(cadastro_a, compras, how='left', on=['Id'])

In [113]:
compras

       Id        Data  Valor
0  AA2930  2019-01-01    200
1  EF4488  2019-01-30    100
2  CC2139  2019-01-30     40
3  EF4488  2019-02-01    150
4  CC9999  2019-02-20    300
5  AA2930  2019-03-15     25
6  HH1158  2019-04-01     50
7  HH1158  2019-04-10    500

In [114]:
cadastro_a

       Id     Nome  Idade        CEP
0  AA2930   Victor     20  00092-029
1  BB4563   Amanda     35  11111-111
2  CC2139    Bruna     40  22222-888
3  DE2521   Carlos     54  00000-999
4  GT3462  Ricardo     30  88888-111
5  HH1158    Maria     27  77777-666

In [115]:
esquerda

       Id     Nome  Idade        CEP        Data  Valor
0  AA2930   Victor     20  00092-029  2019-01-01  200.0
1  AA2930   Victor     20  00092-029  2019-03-15   25.0
2  BB4563   Amanda     35  11111-111         NaN    NaN
3  CC2139    Bruna     40  22222-888  2019-01-30   40.0
4  DE2521   Carlos     54  00000-999         NaN    NaN
5  GT3462  Ricardo     30  88888-111         NaN    NaN
6  HH1158    Maria     27  77777-666  2019-04-01   50.0
7  HH1158    Maria     27  77777-666  2019-04-10  500.0

In [116]:
esquerda.groupby(['Id', 'Nome'])['Valor'].sum()

Id      Nome
AA2930  Victor     225.0
BB4563  Amanda       0.0
CC2139  Bruna       40.0
DE2521  Carlos       0.0
GT3462  Ricardo      0.0
HH1158  Maria      550.0
Name: Valor, dtype: float64

## 2.3. Groupby

In [125]:
dfg = pd.DataFrame({'A': ['verdadeiro', 'falso', 'verdadeiro', 'falso', 'verdadeiro', 'falso', 'verdadeiro', 'falso'],
                    
                    'B': ['um', 'um', 'dois', 'tres', 'dois', ' dois', 'um ', 'tres'],
                    
                    'C': np.random.randn(8),
                    
                    'D': np.random.randn(8)})

In [126]:
dfg

            A      B         C         D
0  verdadeiro     um -1.827644 -2.538711
1       falso     um  1.021796 -1.827049
2  verdadeiro   dois  0.219348 -0.224916
3       falso   tres  0.573037 -0.359021
4  verdadeiro   dois  1.125446 -0.420238
5       falso   dois -0.895374  0.409150
6  verdadeiro    um   0.647556 -1.308707
7       falso   tres -0.536404  0.798657

#### Soma dos valores das colunas baseada na coluna A

In [127]:
dfg.groupby(['A']).sum()

                   C         D
A
falso       0.163055 -0.978263
verdadeiro  0.164705 -4.492572

#### Média dos valores das colunas baseada na coluna A

In [128]:
dfg.groupby(['A']).mean()

                   C         D
A
falso       0.040764 -0.244566
verdadeiro  0.041176 -1.123143

#### Soma dos valores das colunas baseada na coluna B

In [130]:
dfg.groupby(['B']).sum()

              C         D
B
 dois -0.895374  0.409150
dois   1.344794 -0.645154
tres   0.036633  0.439636
um    -0.805849 -4.365760
um     0.647556 -1.308707

#### Média dos valores das colunas baseada na coluna B

In [129]:
dfg.groupby(['B']).mean()

              C         D
B
 dois -0.895374  0.409150
dois   0.672397 -0.322577
tres   0.018317  0.219818
um    -0.402924 -2.182880
um     0.647556 -1.308707

#### Soma dos valores das colunas baseada nas colunas A e B

In [131]:
dfg.groupby(['A','B']).sum()

                         C         D
A          B
falso       dois -0.895374  0.409150
           tres   0.036633  0.439636
           um     1.021796 -1.827049
verdadeiro dois   1.344794 -0.645154
           um    -1.827644 -2.538711
           um     0.647556 -1.308707

## 2.4. Indexação

Todo índice em pyhon inicia em 0.

Sempre que quisermos selecionar algum objeto em uma lista, devemos considerar esse requisito.

In [132]:
lista = [ 32, 96, 11, 27]

In [133]:
lista[0]

32

Sempre que quisermos selecionar os números de trás pra frente, basta adicionar o sinal de subtração e ordenar a casa

In [134]:
lista [-1]

27

### Indexação múltlipla

In [135]:
arrays = [[1, 2, 5, 4], ['red', 'blue', 'green', 'blue']]

In [136]:
pd.MultiIndex.from_arrays(arrays, names=('number', 'color'))

MultiIndex([(1,   'red'),
            (2,  'blue'),
            (5, 'green'),
            (4,  'blue')],
           names=['number', 'color'])

In [137]:
numbers = [0, 1, 2]
colors = ['green', 'purple']

**MultiIndex com produto cartesiano**

In [139]:
pd.MultiIndex.from_product([numbers, colors], names = ['number', 'color'])

MultiIndex([(0,  'green'),
            (0, 'purple'),
            (1,  'green'),
            (1, 'purple'),
            (2,  'green'),
            (2, 'purple')],
           names=['number', 'color'])

## 2.5. Reshping dados